package homework4;

public class Text {
    // INVOKE = ВЫЗВАТЬ

//    Цель: Научиться обрабатывать ситуации с точки зрения SOLID, когда требуется уточнить существующее поведение без модификации существующего кода.
//
//    Предположим, что у нас уже написаны команды MoveCommand и RotateCommand.
//    Теперь возникло новое требование: пользователи в игре могут устанавливать правило
//    - во время движение расходуется топливо, двигаться можно только при наличии топлива.
//
//    Реализовать новую возможность можно введя две новые команды.
//    CheckFuelCommand и BurnFuelCommand.
//    CheckFuelCommand проверяет, что топлива достаточно, если нет, то выбрасывает исключение CommandException.
//    BurnFuelCommand уменьшает количество топлива на скорость расхода топлива.
//
//    После этого мы можем три команды выстроить в цепочку.
//    CheckFuelCommand MoveCommand BurnFuelCommand
//
//    Чтобы это было прозрачно для пользователя реализуем Макрокоманду - специальную разновидность команды, которая в конструкторе принимает массив команда,
//    а методе execute их все последовательно выполняет.
//
//    При повороте движущегося объекта меняется вектор мгновенной скорости. Напишите команду, которая модифицирует вектор мгновенной скорости, в случае поворота.
//    Постройте цепочку команд для поворота.
//
//////////////////////////////////////////////////////////////////////////////////
//////Описание/Пошаговая инструкция выполнения домашнего задания: ////////////////
//////////////////////////////////////////////////////////////////////////////////
//    1.Реализовать класс CheckFuelCommand и тесты к нему.
//    2.Реализовать класс BurnFuelCommand и тесты к нему.
//    3.Реализовать простейшую макрокоманду и тесты к ней. Здесь простейшая - это значит, что при выбросе исключения вся последовательность команд приостанавливает свое выполнение, а макрокоманда выбрасывает CommandException.
//    4.Реализовать команду движения по прямой с расходом топлива, используя команды с предыдущих шагов.
//    5.Реализовать команду для модификации вектора мгновенной скорости при повороте. Необходимо учесть, что не каждый разворачивающийся объект движется.
//    6.Реализовать команду поворота, которая еще и меняет вектор мгновенной скорости, если есть.
//
//    Критерии оценки:
//    Домашнее задание сдано - 1 балл.
//    Реализована команда CheckFuelCommand - 1балл
//    Написаны тесты к CheckFuelCommand - 1 балл
//    Реализована команда BurnFuelCommand - 1балл
//    Написаны тесты к BurnFuelCommand - 1 балл
//    Реализована макрокоманда движения по прямой с расходом топлива и тесты к ней - 1 балл
//    Написаны тесты к MacroCommand - 1 балл
//    Реализована команда ChangeVelocityCommand - 1балл
//    Написаны тесты к ChangeVelocityCommand - 1 балл
//    Реализована команда поворота, которая еще и меняет вектор мгновенной скорости - 1балл -- сначала поворачиваем нос, потом двигаемся, потом сетим Location и Vector ??
            // Ну в этом и задача, что объект достоверно Rotateble и опционально Movable
            // Нет, у Вас есть отдельно движение по прямой, есть поворот - выполните обе команды и получите то, что нужно. Например, их можно собрать в одну макрокоманду
            // 6 - это изменение угла, проверка наличия вектора скорости и его пересчет с помощью 5
            // 6 - команда поворота + команда корректировки вектора мгновенной скорости (п. 5)
    // нужно посчитать длину вектора
    // 5 - изменили вектор, если вектора нет - просто изменили угол
    // 6 [макрокоманда] - повернули => изменили вектор, чтобы не валил боком, а если вектора нет, то просто меняем угол
    // 6 -
}
